chore: update email address and correct prometheus host port mapping
